{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "quantization_config": {
    "act_bits": 16,
    "act_data_type": "fp8_sym",
    "act_dynamic": true,
    "act_group_size": -1,
    "act_sym": true,
    "activation_scheme": "dynamic",
    "amp": true,
    "autoround_version": "0.5.0",
    "batch_size": 8,
    "bits": 8,
    "data_type": "fp8_sym",
    "dataset": "NeelNanda/pile-10k",
    "enable_minmax_tuning": true,
    "enable_norm_bias_tuning": false,
    "enable_quanted_input": true,
    "fmt": "e5m2",
    "gradient_accumulate_steps": 1,
    "group_size": -1,
    "iters": 0,
    "low_gpu_mem_usage": false,
    "lr": 0.005,
    "minmax_lr": 0.005,
    "nsamples": 128,
    "packing_format": "auto_round:auto_gptq",
    "quant_method": "fp8",
    "scale_dtype": "torch.float16",
    "seqlen": 2048,
    "super_bits": null,
    "super_group_size": null,
    "sym": true,
    "to_quant_block_names": null
  },
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.0.dev0",
  "use_cache": true,
  "vocab_size": 128256
}
